Table of Contents
 Class ParameterDouble
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Double parameter of cross-section
public class ParameterDouble : Parameter
Inheritance
object
OpenObject
Parameter
ParameterDouble
Inherited Members
 Parameter.Name
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Value
Value
public double Value { get; set; }
Property Value
double
 Edit this page